Public Attributes | List of all members
API_SafetyPrefs Struct Reference
Project Settings
The representation of the Preferences / Miscellaneous tab page. More...
#include <APIdefs_Environment.h>
 Public Attributes
IO::Location *  | tempFolder
the location of the temporary folder
Detailed Description
The representation of the Preferences / Miscellaneous tab page.
Remarks
This structure is used by the ACAPI_ProjectSetting_GetPreferences function to get the settings of the safety preferences page.
Member Data Documentation
◆ tempFolder
 API_SafetyPrefs::tempFolder
the location of the temporary folder